libretiny-eu/libretiny/boards/lsc-lma35/variant.h
/* This file was auto-generated from lsc-lma35.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         15
#define NUM_DIGITAL_PINS   15
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 6u     // GPIO23
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE2_SCL         5u  // GPIO0
#define PIN_WIRE2_SDA         14u // GPIO1

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL1_RX          12u // GPIO10
#define PIN_SERIAL1_TX          13u // GPIO11
#define PIN_SERIAL2_RX          14u // GPIO1
#define PIN_SERIAL2_TX          5u  // GPIO0
